
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	РассчитатьСумму(ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСумму(ТекущаяСтрока)
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество*ТекущаяСтрока.Цена;
	ОбновитьСуммуДокумента();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммуДокумента()
	Объект.СуммаДокумента = Объект.Товары.итог("Сумма")
КонецПроцедуры

#КонецОбласти